blog/app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 27
---
<li id="post_<%= post.id%>">
<%= link_to  post.title, post_path(post)%>(<%= post.comments.size %>)