blog/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 19
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 19
---
<ul>
<% if @post.comments.any? %>