blog/app/controllers/comments_controller.rb

def create
  @post = Post.find(params[:post_id])
  @comment = Post.find(params[:post_id]).comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "19"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "test"], ["commenter", "test1"], ["created_at", Fri, 19 Apr 2013 15:46:16 UTC +00:00], ["post_id", 19], ["updated_at", Fri, 19 Apr 2013 15:46:16 UTC +00:00]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 19