blog/app/controllers/posts_controller.rb

 def index
    @posts = Post.all(:order => "created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

 def show
    @post = Post.find(params[:id])
    @comment = Post.find(params[:id]).comments.build
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 19

 def create
  @post = Post.new(params[:post])
   if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "add test"], ["created_at", Mon, 15 Apr 2013 16:07:41 UTC +00:00], ["title", "titles"], ["updated_at", Mon, 15 Apr 2013 16:07:41 UTC +00:00]]

def update
  @post = Post.find(params[:id])
  if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "posts" SET "title" = '4444444', "content" = 'ccccccc', "updated_at" = '2013-04-19 13:30:11.203533' WHERE "posts"."id" = 3